yyii-site/Arduino_esp32-s2_PZEM-004T/src/main.cpp
  LOGERROR(F("Connecting MultiWifi..."));

  //WiFi.mode(WIFI_STA);

#if !USE_DHCP_IP
  // New in v1.4.0
  configWiFi(WM_STA_IPconfig);
  //////
#endif

  int i = 0;
  status = wifiMulti.run();
  delay(WIFI_MULTI_1ST_CONNECT_WAITING_MS);

  while ( ( i++ < 20 ) && ( status != WL_CONNECTED ) )
  {
    status = WiFi.status();

    if ( status == WL_CONNECTED )
      break;
    else
      delay(WIFI_MULTI_CONNECT_WAITING_MS);
  }

  if ( status == WL_CONNECTED )
  {
    LOGERROR1(F("WiFi connected after time: "), i);
    LOGERROR3(F("SSID:"), WiFi.SSID(), F(",RSSI="), WiFi.RSSI());
    LOGERROR3(F("Channel:"), WiFi.channel(), F(",IP address:"), WiFi.localIP() );
  }
  else
  {
    LOGERROR(F("WiFi not connected"));

    // To avoid unnecessary DRD
    drd->loop();
  
#if ESP8266      
    ESP.reset();
#else
    ESP.restart();
#endif  
  }

  return status;
}

void toggleLED()
{
  //toggle state
  digitalWrite(LED_PIN, !digitalRead(LED_PIN));
}

#if USE_ESP_WIFIMANAGER_NTP

void printLocalTime()
{
#if ESP8266
  static time_t now;
  
  now = time(nullptr);
  
  if ( now > 1451602800 )
  {
    Serial.print("Local Date/Time: ");
    Serial.print(ctime(&now));
  }
#else
  struct tm timeinfo;

  getLocalTime( &timeinfo );

  // Valid only if year > 2000. 
  // You can get from timeinfo : tm_year, tm_mon, tm_mday, tm_hour, tm_min, tm_sec
  if (timeinfo.tm_year > 100 )
  {
    Serial.print("Local Date/Time: ");
    Serial.print( asctime( &timeinfo ) );
  }
#endif
}

#endif

void heartBeatPrint()
{
#if USE_ESP_WIFIMANAGER_NTP
  printLocalTime();
#else

  static int num = 1;

  if (WiFi.status() == WL_CONNECTED)
    Serial.print(F("W"));        // W means connected to WiFi
  else
    Serial.print(F("N"));        // N means not connected to WiFi

  if (num == 80)
  {
    Serial.println();
    num = 1;
  }
  else if (num++ % 5 == 0)
  {
    Serial.print(F(" "));
  }
#endif  
}

void TEMPERtoMQTT()
{
  float some_number = 25.0 + (float) ( millis() % 100 ) /  100;

  // For debug only
  //Serial.print(F("Published Temp = "));
  //Serial.println(some_number);
  
  if (Temperature->publish(some_number)) 
  {
    Serial.println(F("Temperature publish ok"));        // T means publishing OK
  }
  else 
  {
    Serial.println(F("Temperature publish failed"));        // F means publishing failure
  }
}

void PZEMtoMQTT()
{
  StaticJsonDocument<JSON_MSG_BUFFER> jsonBuffer;
  JsonObject PZEMdata = jsonBuffer.to<JsonObject>();
  PZEMdata["temperature"]   = ds18b20_celsius;
  PZEMdata["voltage"]   = pzem.voltage();
  PZEMdata["current"]   = pzem.current();
  PZEMdata["power"]     = pzem.power();
  PZEMdata["energy"]    = pzem.energy();
  PZEMdata["frequency"] = pzem.frequency();
  PZEMdata["pf"]        = pzem.pf();
  String StrBuff;
  serializeJson(jsonBuffer, StrBuff);
  Serial.println(StrBuff);
  if(Pub_PowerMeter->publish(StrBuff.c_str()))
  {
    Serial.println(F("Value to PowerMeter feed sucessfully sent!"));
  }
  else 
  {
    Serial.println(F("Failed to send value to PowerMeter feed!"));
  }
}

void publishMQTT()
{
  MQTT_connect();
  TEMPERtoMQTT();
  PZEMtoMQTT();
}

void check_WiFi()
{
  if ( (WiFi.status() != WL_CONNECTED) )
  {
    Serial.println(F("\nWiFi lost. Call connectMultiWiFi in loop"));
    connectMultiWiFi();
  }
}  

void check_status()
{
  static ulong checkstatus_timeout  = 0;
  static ulong LEDstatus_timeout    = 0;
  static ulong checkwifi_timeout    = 0;
  static ulong mqtt_publish_timeout = 0;
  static ulong checkPZEM_timeout    = 0;
  
  ulong current_millis = millis();

#define LED_INTERVAL          5000L
#define PUBLISH_INTERVAL      30000L

#define WIFICHECK_INTERVAL    1000L

#if USE_ESP_WIFIMANAGER_NTP
  #define HEARTBEAT_INTERVAL    60000L
#else
  #define HEARTBEAT_INTERVAL    10000L
#endif

#define PZEMCHECK_INTERVAL    120000L

  // Check WiFi every WIFICHECK_INTERVAL (1) seconds.
  if ((current_millis > checkwifi_timeout) || (checkwifi_timeout == 0))
  {
    check_WiFi();
    checkwifi_timeout = current_millis + WIFICHECK_INTERVAL;
  }

  if ((current_millis > LEDstatus_timeout) || (LEDstatus_timeout == 0))
  {
    // Toggle LED at LED_INTERVAL = 2s
    toggleLED();
    if(digitalRead(LED_PIN) == LED_ON)
      LEDstatus_timeout = current_millis + LED_INTERVAL/100;
    else
      LEDstatus_timeout = current_millis + LED_INTERVAL;
  }

  // Print hearbeat every HEARTBEAT_INTERVAL (10) seconds.
  if ((current_millis > checkstatus_timeout) || (checkstatus_timeout == 0))
  { 
    heartBeatPrint();
    checkstatus_timeout = current_millis + HEARTBEAT_INTERVAL;
  }

  // Check every PUBLISH_INTERVAL (60) seconds.
  if ((current_millis > mqtt_publish_timeout) || (mqtt_publish_timeout == 0))
  {
    if (WiFi.status() == WL_CONNECTED)
    {
      publishMQTT();
    }
    
    mqtt_publish_timeout = current_millis + PUBLISH_INTERVAL;
  }

  if ((current_millis > checkPZEM_timeout) || (checkPZEM_timeout == 0))
  {
    float voltage = pzem.voltage();
    if(isnan(voltage)){
        Serial.println("Error reading PZEM voltage");
    }
    else
    {
      Serial.print("PZEM Voltage: ");    Serial.print(voltage);
      Serial.println("V");
    }
    checkPZEM_timeout = current_millis + PZEMCHECK_INTERVAL;
  }
}

int calcChecksum(uint8_t* address, uint16_t sizeToCalc)
{
  uint16_t checkSum = 0;
  
  for (uint16_t index = 0; index < sizeToCalc; index++)
  {
    checkSum += * ( ( (byte*) address ) + index);
  }

  return checkSum;
}

bool loadConfigData()
{
  File file = FileFS.open(CONFIG_FILENAME, "r");
  LOGERROR(F("LoadWiFiCfgFile "));

  memset((void *) &WM_config,       0, sizeof(WM_config));

  // New in v1.4.0
  memset((void *) &WM_STA_IPconfig, 0, sizeof(WM_STA_IPconfig));
  //////

  if (file)
  {
    file.readBytes((char *) &WM_config,   sizeof(WM_config));

    // New in v1.4.0
    file.readBytes((char *) &WM_STA_IPconfig, sizeof(WM_STA_IPconfig));
    //////

    file.close();
    LOGERROR(F("OK"));

    if ( WM_config.checksum != calcChecksum( (uint8_t*) &WM_config, sizeof(WM_config) - sizeof(WM_config.checksum) ) )
    {
      LOGERROR(F("WM_config checksum wrong"));
      
